#include "banks.h"
#define MYBANK BANK_3

#include "b1cp_terminal.h"


void banner() {
  tputs(" ‹‹‹‹‹‹‹‹‹‹‹  ‹‹‹‹‹‹‹‹‹‹‹  ‹‹‹‹‹‹‹‹‹‹‹  ‹‹‹‹‹‹‹‹‹‹‹  ‹‹‹‹‹‹‹‹‹‹‹ \n");
  tputs("ﬁ∞∞∞∞∞∞∞∞∞∞∞›ﬁ∞∞∞∞∞∞∞∞∞∞∞›ﬁ∞∞∞∞∞∞∞∞∞∞∞›ﬁ∞∞∞∞∞∞∞∞∞∞∞›ﬁ∞∞∞∞∞∞∞∞∞∞∞›\n");
  tputs("ﬁ∞€ﬂﬂﬂﬂﬂﬂﬂﬂﬂ ﬁ∞€ﬂﬂﬂﬂﬂﬂﬂ€∞›ﬁ∞€ﬂﬂﬂﬂﬂﬂﬂ€∞›ﬁ∞€ﬂﬂﬂﬂﬂﬂﬂﬂﬂ ﬁ∞€ﬂﬂﬂﬂﬂﬂﬂﬂﬂ \n");
  tputs("ﬁ∞›          ﬁ∞›       ﬁ∞›ﬁ∞›       ﬁ∞›ﬁ∞›          ﬁ∞›          \n");
  tputs("ﬁ∞€‹‹‹‹‹‹‹‹‹ ﬁ∞›       ﬁ∞›ﬁ∞€‹‹‹‹‹‹‹€∞›ﬁ∞›          ﬁ∞€‹‹‹‹‹‹‹‹‹ \n");
  tputs("ﬁ∞∞∞∞∞∞∞∞∞∞∞›ﬁ∞›       ﬁ∞›ﬁ∞∞∞∞∞∞∞∞∞∞∞›ﬁ∞›          ﬁ∞∞∞∞∞∞∞∞∞∞∞›\n");
  tputs("ﬁ∞€ﬂﬂﬂﬂﬂﬂﬂﬂﬂ ﬁ∞›       ﬁ∞›ﬁ∞€ﬂﬂﬂﬂ€∞€ﬂﬂ ﬁ∞›          ﬁ∞€ﬂﬂﬂﬂﬂﬂﬂﬂﬂ \n");
  tputs("ﬁ∞›          ﬁ∞›       ﬁ∞›ﬁ∞›     ﬁ∞›  ﬁ∞›          ﬁ∞›          \n");
  tputs("ﬁ∞›          ﬁ∞€‹‹‹‹‹‹‹€∞›ﬁ∞›      ﬁ∞› ﬁ∞€‹‹‹‹‹‹‹‹‹ ﬁ∞€‹‹‹‹‹‹‹‹‹ \n");
  tputs("ﬁ∞›          ﬁ∞∞∞∞∞∞∞∞∞∞∞›ﬁ∞›       ﬁ∞›ﬁ∞∞∞∞∞∞∞∞∞∞∞›ﬁ∞∞∞∞∞∞∞∞∞∞∞›\n");
  tputs(" ﬂ            ﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂ  ﬂ         ﬂ  ﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂ  ﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂ \n");
  tputs(" €€€€€€ª €€€€€€ª €€€ª   €€€ª€€€ª   €€€ª €€€€€ª €€€ª   €€ª€€€€€€ª \n");
  tputs("€€…ÕÕÕÕº€€…ÕÕÕ€€ª€€€€ª €€€€∫€€€€ª €€€€∫€€…ÕÕ€€ª€€€€ª  €€∫€€…ÕÕ€€ª\n");
  tputs("€€∫     €€∫   €€∫€€…€€€€…€€∫€€…€€€€…€€∫€€€€€€€∫€€…€€ª €€∫€€∫  €€∫\n");
  tputs("€€∫     €€∫   €€∫€€∫»€€…º€€∫€€∫»€€…º€€∫€€…ÕÕ€€∫€€∫»€€ª€€∫€€∫  €€∫\n");
  tputs("»€€€€€€ª»€€€€€€…º€€∫ »Õº €€∫€€∫ »Õº €€∫€€∫  €€∫€€∫ »€€€€∫€€€€€€…º\n");
  tputs(" »ÕÕÕÕÕº »ÕÕÕÕÕº »Õº     »Õº»Õº     »Õº»Õº  »Õº»Õº  »ÕÕÕº»ÕÕÕÕÕº \n");
}

